return {
  {
    name = "天魁星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天魔星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天机星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天闲星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天勇星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天雄星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天猛星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天威星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天英星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天贵星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天富星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天满星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天孤星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天伤星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天立星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天捷星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天暗星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天祐星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天空星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天速星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天异星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天杀星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天微星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天究星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天退星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天寿星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天剑星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天平星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天罪星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "天损星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地魁星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地煞星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地勇星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地杰星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地雄星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地威星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地英星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地奇星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地猛星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地文星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地正星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地辟星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地阖星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地强星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地暗星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地辅星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地会星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地佐星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地佑星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地灵星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地兽星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地微星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地慧星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地暴星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地默星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地猖星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地狂星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地飞星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地走星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "地巧星",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此指点有缘之人，不知谁可一战？",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "鬼差黑无常",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显冥界威名，但求一败！",
        "name"
      },
      {
        "本鬼差正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "鬼差白无常",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显冥界威名，但求一败！",
        "name"
      },
      {
        "本鬼差正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "鬼差牛头",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显冥界威名，但求一败！",
        "name"
      },
      {
        "本鬼差正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "鬼差马面",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显冥界威名，但求一败！",
        "name"
      },
      {
        "本鬼差正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "鬼差绝阴",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显冥界威名，但求一败！",
        "name"
      },
      {
        "本鬼差正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "鬼差泰煞",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显冥界威名，但求一败！",
        "name"
      },
      {
        "本鬼差正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "鬼差犯武",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显冥界威名，但求一败！",
        "name"
      },
      {
        "本鬼差正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "鬼差罪气",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显冥界威名，但求一败！",
        "name"
      },
      {
        "本鬼差正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "鬼差宗灵",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显冥界威名，但求一败！",
        "name"
      },
      {
        "本鬼差正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "鬼差宛屡",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显冥界威名，但求一败！",
        "name"
      },
      {
        "本鬼差正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "角木蛟",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "亢金龙",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "氐土貉",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "房日兔",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "心月狐",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "尾火虎",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "箕水豹",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "井木犴",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "鬼金羊",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "柳土獐",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "星日马",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "张月鹿",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "翼火蛇",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "轸水蚓",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "奎木狼",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "娄金狗",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "胃土雉",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "昴日鸡",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "毕月乌",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "觜火猴",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "参水猿",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "斗木獬",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "牛金牛",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "女土蝠",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "虚日鼠",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "危月燕",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "室火猪",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "壁水獝",
    name_match = "=",
    msg = {
      {
        "我乃#Y%s#n，在此彰显仙界威名，但求一败！",
        "name"
      },
      {
        "本星君正在接受挑战，#R旁人勿扰#n！",
        "name"
      }
    }
  },
  {
    name = "上古妖王%d+",
    name_match = "%",
    msg = {
      {
        "本座乃魔界#Y%s#n，好久不识肉味，谁要送上门来？",
        "name"
      },
      "本座正在收拾这伙臭道士，#R怕死的离远点#n！"
    }
  },
  {
    name = "万年老妖%d+",
    name_match = "%",
    msg = {
      {
        "本座乃魔界#Y%s#n，好久不识肉味，谁要送上门来？",
        "name"
      },
      "本座正在收拾这伙臭道士，#R怕死的离远点#n！"
    }
  },
  {
    name = "海盗",
    name_match = "=",
    msg = {
      "做为#Y海盗#n，我们的生活就是吹海风，抢东西！",
      "没看见正在抢东西吗？#R别来烦大爷#n！"
    }
  },
  {
    name = "凶魂",
    name_match = "=",
    msg = {
      "#Y本妖#n被困了许久，自由的感觉真好！",
      "好久没吃人肉了，今天就拿这伙人开刀吧，#R生人勿近#n！"
    }
  },
  {
    name = "恶鬼",
    name_match = "=",
    msg = {
      "#Y本妖#n被困了许久，自由的感觉真好！",
      "好久没吃人肉了，今天就拿这伙人开刀吧，#R生人勿近#n！"
    }
  },
  {
    name = "僵尸王",
    name_match = "=",
    msg = {
      "#Y本妖#n被困了许久，自由的感觉真好！",
      "好久没吃人肉了，今天就拿这伙人开刀吧，#R生人勿近#n！"
    }
  },
  {
    name = "文曲星",
    name_match = "=",
    msg = "我乃天界星官#Y文曲星#n，巡游至此指点有缘之人答题。"
  },
  {
    name = "羊头怪",
    name_match = "=",
    msg = {
      "大胆狂徒，敢在#Y本大王#n面前撒野，真是活得不耐烦了！",
      "本大王现在正忙着呢，#R别来烦我#n，过会儿再收拾你！"
    }
  },
  {
    name = "牛头怪",
    name_match = "=",
    msg = {
      "大胆狂徒，敢在#Y本大王#n面前撒野，真是活得不耐烦了！",
      "本大王现在正忙着呢，#R别来烦我#n，过会儿再收拾你！"
    }
  },
  {
    name = "百年黑熊精",
    name_match = "=",
    msg = {
      "大胆狂徒，敢在#Y本大王#n面前撒野，真是活得不耐烦了！",
      "本大王现在正忙着呢，#R别来烦我#n，过会儿再收拾你！"
    }
  },
  {
    name = "百年狂狮怪",
    name_match = "=",
    msg = {
      "大胆狂徒，敢在#Y本大王#n面前撒野，真是活得不耐烦了！",
      "本大王现在正忙着呢，#R别来烦我#n，过会儿再收拾你！"
    }
  },
  {
    name = "百年刺猬精",
    name_match = "=",
    msg = {
      "大胆狂徒，敢在#Y本大王#n面前撒野，真是活得不耐烦了！",
      "本大王现在正忙着呢，#R别来烦我#n，过会儿再收拾你！"
    }
  },
  {
    name = "百年猪妖",
    name_match = "=",
    msg = {
      "大胆狂徒，敢在#Y本大王#n面前撒野，真是活得不耐烦了！",
      "本大王现在正忙着呢，#R别来烦我#n，过会儿再收拾你！"
    }
  },
  {
    name = "百年象精",
    name_match = "=",
    msg = {
      "大胆狂徒，敢在#Y本大王#n面前撒野，真是活得不耐烦了！",
      "本大王现在正忙着呢，#R别来烦我#n，过会儿再收拾你！"
    }
  },
  {
    name = "百花羞",
    name_match = "=",
    msg = {
      "大胆狂徒，敢在#Y本大王#n面前撒野，真是活得不耐烦了！",
      "本大王现在正忙着呢，#R别来烦我#n，过会儿再收拾你！"
    }
  },
  {
    name = "牛魔王",
    name_match = "=",
    msg = {
      "大胆狂徒，敢在#Y本大王#n面前撒野，真是活得不耐烦了！",
      "本大王现在正忙着呢，#R别来烦我#n，过会儿再收拾你！"
    }
  },
  {
    name = "夜叉王",
    name_match = "=",
    msg = {
      "大胆狂徒，敢在#Y本大王#n面前撒野，真是活得不耐烦了！",
      "本大王现在正忙着呢，#R别来烦我#n，过会儿再收拾你！"
    }
  },
  {
    name = "罗刹王",
    name_match = "=",
    msg = {
      "大胆狂徒，敢在#Y本大王#n面前撒野，真是活得不耐烦了！",
      "本大王现在正忙着呢，#R别来烦我#n，过会儿再收拾你！"
    }
  },
  {
    name = "白骨精",
    name_match = "=",
    msg = {
      "大胆狂徒，敢在#Y本大王#n面前撒野，真是活得不耐烦了！",
      "本大王现在正忙着呢，#R别来烦我#n，过会儿再收拾你！"
    }
  },
  {
    name = "孔雀妖姬",
    name_match = "=",
    msg = {
      "大胆狂徒，敢在#Y本大王#n面前撒野，真是活得不耐烦了！",
      "本大王现在正忙着呢，#R别来烦我#n，过会儿再收拾你！"
  },
  {
    name = "猎杀者",
    name_match = "=",
    msg = {
      "欢迎测试全网稳定版本发财猫",
      "本大王现在正忙着呢，#R别来烦我#n，过会儿再收拾你！"	  
    }
  }
}
